Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.test-bucket-1 has been deleted
- resource "aws_s3_bucket" "test-bucket-1" {
      - arn                         = "arn:aws:s3:::my-tf-bucket-11111" -> null
      - id                          = "my-tf-bucket-11111" -> null
        tags                        = {}
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.s3-readonly-policy will be updated in-place
~ resource "aws_iam_policy" "s3-readonly-policy" {
        id          = "arn:aws:iam::519025668110:policy/s3-readonly-policy"
        name        = "s3-readonly-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:Get*",
                          - "s3:List*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::my-tf-bucket-11111"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket.test-bucket-1 will be created
+ resource "aws_s3_bucket" "test-bucket-1" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-tf-bucket-11111"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_object.file_upload will be created
+ resource "aws_s3_object" "file_upload" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "b8666709888eb0d0896c9325baae03c8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "my_bucket_key"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./test.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://ba06-171-241-73-95.ngrok-free.app/lock?id=huylinh1997%252Fterraform-training%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`